In [31]:
import numpy as np
import pandas as pd

In [32]:
t=pd.DataFrame(np.random.randint(1,100,12).reshape(3,4),index=list('acb'),columns=list('ACDB'))
t

    A   C   D   B
a  44   9  95  34
c  10  96  48   6
b  63  36  55  11

In [6]:
t.loc[['c'],['A']]=np.nan
t.loc[['b'],['B']]=np.nan
t

      A   C   D     B
a  24.0   4  41  24.0
c   NaN  95  34  79.0
b  11.0  51  15   NaN

In [7]:
t.describe()

               A          C          D          B
count   2.000000   3.000000   3.000000   2.000000
mean   17.500000  50.000000  30.000000  51.500000
std     9.192388  45.508241  13.453624  38.890873
min    11.000000   4.000000  15.000000  24.000000
25%    14.250000  27.500000  24.500000  37.750000
50%    17.500000  51.000000  34.000000  51.500000
75%    20.750000  73.000000  37.500000  65.250000
max    24.000000  95.000000  41.000000  79.000000

### argmin（）、argmax（）、ldxmin（）、ldxmax（）

In [11]:
d=pd.Series(np.random.randint(1,100,5),index=list('abcde'))
d

a    35
b    96
c    47
d    31
e    33
dtype: int32

In [29]:
d.values.argmax()   #该方法代替d.argmax()

1

In [23]:
t

      A   C   D     B
a  24.0   4  41  24.0
c   NaN  95  34  79.0
b  11.0  51  15   NaN

In [26]:
t.idxmin(axis=0)

A    b
C    a
D    b
B    a
dtype: object

### unique、isin

In [ ]:
d.unique()

In [40]:
t.loc[:,'A'].unique()

array([24., nan, 11.])

In [43]:
t.isin([10])  #判断10是否在t中

       A      C      D      B
a  False  False  False  False
c  False  False  False  False
b  False  False  False  False

### value_counts 
统计某列中每个元素出来的次数--Series才可以

In [148]:
t=pd.DataFrame(np.random.randint(1,100,12).reshape(3,4),index=list('acb'),columns=list('ACDB'))
t

    A   C   D   B
a  86  37  89  71
c  82   4  82  96
b  33  19  46   1

In [9]:
t['A'].value_counts()

2     1
58    1
56    1
Name: A, dtype: int64

t.value_counts()  #DF类型的数组，，不可以调用.value_counts()  函数

In [12]:
t.loc['a'].value_counts()   #元素出现频率计算

84    1
91    1
2     1
1     1
Name: a, dtype: int64

### 索引设置--set_index  ,,   reset_index

#### 修改行列索引--rename（）

In [149]:
t['A']=['2018','2018','2017']
t['C']=['主板','创业板','zip板']
t

      A     C   D   B
a  2018    主板  89  71
c  2018   创业板  82  96
b  2017  zip板  46   1

In [151]:
t1=t.rename(columns={'A':'date','C':'market','D':'pe_2015','B':'pe_2016'})
t1
#第二种方法是

   date market  pe_2015  pe_2016
a  2018     主板       89       71
c  2018    创业板       82       96
b  2017   zip板       46        1

#### 插入列---insert

In [152]:
t1.insert(1,'industry',['银行','银行','zip券公司'])

In [139]:
t1

   date industry market  pe_2015  pe_2016
a  2018       银行     主板       88       29
c  2018       银行    创业板       10       64
b  2017   zip券公司   zip板       18       70

#### 普通索引--传入一个索引

In [43]:
t1.set_index('date')

          industry market  pe_2015  pe_2016
date
2019-10-1       银行     主板       88       29
2018-10-2       银行    创业板       10       64
2017-10-3   zip券公司   zip板       18       70

#### 层次化索引，传入多个行索引

In [45]:
t1.reset_index(drop=True)   #drop=True删除原来的索引

        date industry market  pe_2015  pe_2016
0  2019-10-1       银行     主板       88       29
1  2018-10-2       银行    创业板       10       64
2  2017-10-3   zip券公司   zip板       18       70

In [46]:
t1.set_index(['industry','market'])

                      date  pe_2015  pe_2016
industry market
银行       主板      2019-10-1       88       29
         创业板     2018-10-2       10       64
zip券公司   zip板    2017-10-3       18       70

### 索引重塑--层次化--satck  和unstack

In [49]:
t1.reset_index(drop=True)

        date industry market  pe_2015  pe_2016
0  2019-10-1       银行     主板       88       29
1  2018-10-2       银行    创业板       10       64
2  2017-10-3   zip券公司   zip板       18       70

In [131]:
type(t1['pe_2015'])

pandas.core.series.Series

In [58]:
t2=t1.stack()
t2

a  date        2019-10-1
   industry           银行
   market             主板
   pe_2015            88
   pe_2016            29
c  date        2018-10-2
   industry           银行
   market            创业板
   pe_2015            10
   pe_2016            64
b  date        2017-10-3
   industry       zip券公司
   market           zip板
   pe_2015            18
   pe_2016            70
dtype: object

In [104]:
t3=t2.unstack()
t3

        date industry market pe_2015 pe_2016
a  2019-10-1       银行     主板      88      29
c  2018-10-2       银行    创业板      10      64
b  2017-10-3   zip券公司   zip板      18      70

In [175]:
t=pd.DataFrame(np.random.randint(1,100,12).reshape(3,4),index=list('acb'),columns=list('ACDB'))
t['A']=['2018','2018','2017']
t['C']=['主板','创业板','zip板']
t1=t.rename(columns={'A':'date','C':'market','D':'pe_2015','B':'pe_2016'})
t1.insert(1,'industry',['银行','银行','zip券公司'])
t1

   date industry market  pe_2015  pe_2016
a  2018       银行     主板       55       21
c  2018       银行    创业板       45       30
b  2017   zip券公司   zip板       72       55

In [173]:
t2=t1.set_index(['date','industry'])

In [174]:
t2.stack()

date  industry
2018  银行        market       主板
                pe_2015      13
                pe_2016      43
                market      创业板
                pe_2015      52
                pe_2016      64
2017  zip券公司    market     zip板
                pe_2015      49
                pe_2016      95
dtype: object

### 长宽表---melt的使用
有一定的限制

In [208]:
t=pd.DataFrame(np.random.randint(1,100,12).reshape(3,4),index=list('acb'),columns=list('ACDB'))
t['A']=['2018','2018','2017']
t['C']=['主板','创业板','zip板']
t1=t.rename(columns={'A':'date','C':'market','D':'pe_2015','B':'pe_2016'})
t1.insert(1,'industry',['银行','银行','zip券公司'])

In [209]:
t1

   date industry market  pe_2015  pe_2016
a  2018       银行     主板       15       29
c  2018       银行    创业板       55       57
b  2017   zip券公司   zip板       25       24

In [210]:
t1.set_index('date',inplace=True)
t1

     industry market  pe_2015  pe_2016
date
2018       银行     主板       15       29
2018       银行    创业板       55       57
2017   zip券公司   zip板       25       24

In [211]:
mt1=t1.melt(id_vars=['industry','market'],var_name=['year'],value_name='pe')
mt1

  industry market     year  pe
0       银行     主板  pe_2015  15
1       银行    创业板  pe_2015  55
2   zip券公司   zip板  pe_2015  25
3       银行     主板  pe_2016  29
4       银行    创业板  pe_2016  57
5   zip券公司   zip板  pe_2016  24

### 注意数据透视的结果格式的区别
#### 和melt搭配使用
mt2是和长宽表melt搭配后，得到的数据透视表
mt3是普通的一个数据，对其进行数据透视得到的结果
但基本思想一样，取某一列或几列作为行索引，一列作为列索引，一列作为数据对象

In [212]:
mt2=mt1.pivot_table(index=['industry','market'],columns='year',values='pe')
mt2

year             pe_2015  pe_2016
industry market
zip券公司   zip板         25       24
银行       主板           15       29
         创业板          55       57

In [215]:
#注意二者的区别，银行对应的值是-----（主板+创业板）/2  ，因为没有将market作为行索引

mt2=mt1.pivot_table(index=['industry'],columns='year',values='pe')
mt2

year      pe_2015  pe_2016
industry
zip券公司         25       24
银行             35       43

#### pivot_table单独使用

In [204]:
mt3=t1.pivot_table(index=['market'],columns=['industry'],values=['pe_2015','pe_2016'],aggfunc='sum')
mt3

         pe_2015       pe_2016
industry  zip券公司    银行  zip券公司    银行
market
zip板        71.0   NaN    53.0   NaN
主板           NaN  30.0     NaN  32.0
创业板          NaN  83.0     NaN  86.0

In [203]:
t1

     industry market  pe_2015  pe_2016
date
2018       银行     主板       30       32
2018       银行    创业板       83       86
2017   zip券公司   zip板       71       53

### stack 和set_index的搭配使用

In [60]:
t1

        date industry market  pe_2015  pe_2016
a  2019-10-1       银行     主板       88       29
c  2018-10-2       银行    创业板       10       64
b  2017-10-3   zip券公司   zip板       18       70

In [90]:
t3=t1.set_index(['industry','market'])

### 数据分组--groupb（） 和 aggregate（）的搭配使用

In [4]:
import pandas as pd 
import numpy as np

t=pd.DataFrame(np.random.randint(1,100,20).reshape(5,4),columns=list('ACDB'))
t['A']=['2018','2018','2017','2016','2015']
t['C']=['主板','创业板','zip板','主板','创业板']
t1=t.rename(columns={'A':'date','C':'market','D':'pe_2015','B':'pe_2016'})
t1.insert(1,'industry',['银行','银行','zip券公司','银行','quit店'])
t1

   date industry market  pe_2015  pe_2016
0  2018       银行     主板       40       97
1  2018       银行    创业板       11        1
2  2017   zip券公司   zip板       56       32
3  2016       银行     主板       46       24
4  2015    quit店    创业板       26        1

In [7]:
df=t1.groupby('industry')
df

In [9]:
df.count()['market']

industry
quit店     1
zip券公司    1
银行        3
Name: market, dtype: int64

In [10]:
df.sum()['pe_2015']

industry
quit店     26
zip券公司    56
银行        97
Name: pe_2015, dtype: int32

In [11]:
df2=t1.groupby(['industry','market'])
df2

In [12]:
df2.sum()['pe_2015']

industry  market
quit店     创业板       26
zip券公司    zip板      56
银行        主板        86
          创业板       11
Name: pe_2015, dtype: int32

In [13]:
df2.aggregate(['count','sum','mean'])['pe_2015']

                 count  sum  mean
industry market
quit店    创业板         1   26    26
zip券公司   zip板        1   56    56
银行       主板          2   86    43
         创业板         1   11    11

In [91]:
t3.stack()

industry  market
银行        主板      date         2019-10-1
                  open_tod            -5
                  open_yest           10
                  pe_2015             88
                  pe_2016             29
          创业板     date         2018-10-2
                  open_tod            12
                  open_yest           20
                  pe_2015             10
                  pe_2016             64
zip券公司    zip板    date         2017-10-3
                  open_tod            30
                  open_yest           30
                  pe_2015             18
                  pe_2016             70
dtype: object